
<script setup>
let articles = [
    {
        title:'راهنما و آموزش: چطوری از رویدکوین برای پرداخت درون‌برنامه‌ای استفاده کنیم؟',
        img:'/img/img-15.png',
        options:[
            {
                name:'۲۰ فروردین ۱۴۰۳',
                icon:'youtube',
                iconPathCount:0,
            },
            {
                name:'راهنما و آموزش',
                icon:'youtube',
                iconPathCount:0,
            },
        ],
        text:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون...'
    },
    {
        title:'راهنما و آموزش: چطوری از رویدکوین برای پرداخت درون‌برنامه‌ای استفاده کنیم؟',
        img:'/img/img-15.png',
        options:[
            {
                name:'۲۰ فروردین ۱۴۰۳',
                icon:'youtube',
                iconPathCount:0,
            },
            {
                name:'راهنما و آموزش',
                icon:'youtube',
                iconPathCount:0,
            },
        ],
        text:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون...'
    },
    {
        title:'راهنما و آموزش: چطوری از رویدکوین برای پرداخت درون‌برنامه‌ای استفاده کنیم؟',
        img:'/img/img-15.png',
        options:[
            {
                name:'۲۰ فروردین ۱۴۰۳',
                icon:'youtube',
                iconPathCount:0,
            },
            {
                name:'راهنما و آموزش',
                icon:'youtube',
                iconPathCount:0,
            },
        ],
        text:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون...'
    },
    {
        title:'راهنما و آموزش: چطوری از رویدکوین برای پرداخت درون‌برنامه‌ای استفاده کنیم؟',
        img:'/img/img-15.png',
        options:[
            {
                name:'۲۰ فروردین ۱۴۰۳',
                icon:'youtube',
                iconPathCount:0,
            },
            {
                name:'راهنما و آموزش',
                icon:'youtube',
                iconPathCount:0,
            },
        ],
        text:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون...'
    },
    {
        title:'راهنما و آموزش: چطوری از رویدکوین برای پرداخت درون‌برنامه‌ای استفاده کنیم؟',
        img:'/img/img-15.png',
        options:[
            {
                name:'۲۰ فروردین ۱۴۰۳',
                icon:'youtube',
                iconPathCount:0,
            },
            {
                name:'راهنما و آموزش',
                icon:'youtube',
                iconPathCount:0,
            },
        ],
        text:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون...'
    },
    {
        title:'راهنما و آموزش: چطوری از رویدکوین برای پرداخت درون‌برنامه‌ای استفاده کنیم؟',
        img:'/img/img-15.png',
        options:[
            {
                name:'۲۰ فروردین ۱۴۰۳',
                icon:'youtube',
                iconPathCount:0,
            },
            {
                name:'راهنما و آموزش',
                icon:'youtube',
                iconPathCount:0,
            },
        ],
        text:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون...'
    },
    {
        title:'راهنما و آموزش: چطوری از رویدکوین برای پرداخت درون‌برنامه‌ای استفاده کنیم؟',
        img:'/img/img-15.png',
        options:[
            {
                name:'۲۰ فروردین ۱۴۰۳',
                icon:'youtube',
                iconPathCount:0,
            },
            {
                name:'راهنما و آموزش',
                icon:'youtube',
                iconPathCount:0,
            },
        ],
        text:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون...'
    },
    {
        title:'راهنما و آموزش: چطوری از رویدکوین برای پرداخت درون‌برنامه‌ای استفاده کنیم؟',
        img:'/img/img-15.png',
        options:[
            {
                name:'۲۰ فروردین ۱۴۰۳',
                icon:'youtube',
                iconPathCount:0,
            },
            {
                name:'راهنما و آموزش',
                icon:'youtube',
                iconPathCount:0,
            },
        ],
        text:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون...'
    },
    {
        title:'راهنما و آموزش: چطوری از رویدکوین برای پرداخت درون‌برنامه‌ای استفاده کنیم؟',
        img:'/img/img-15.png',
        options:[
            {
                name:'۲۰ فروردین ۱۴۰۳',
                icon:'youtube',
                iconPathCount:0,
            },
            {
                name:'راهنما و آموزش',
                icon:'youtube',
                iconPathCount:0,
            },
        ],
        text:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون...'
    },
    {
        title:'راهنما و آموزش: چطوری از رویدکوین برای پرداخت درون‌برنامه‌ای استفاده کنیم؟',
        img:'/img/img-15.png',
        options:[
            {
                name:'۲۰ فروردین ۱۴۰۳',
                icon:'youtube',
                iconPathCount:0,
            },
            {
                name:'راهنما و آموزش',
                icon:'youtube',
                iconPathCount:0,
            },
        ],
        text:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون...'
    }
]
</script>

<template>
    <ul class="-m-2.5 flex flex-wrap">
        <li class="p-2.5 w-1/2" v-for="(article, index) in articles" :key="index">
            <SectionsBlogContentMainArticlesItem :title="article.title" :text="article.text" :img="article.img" :to="article.to" :options="article.options"/>
        </li>
    </ul>
</template>