
<template>
    <div class="container">
        <p class="tx tx-xl">
            رویدینو، پلتفرم دانلود رایگان بازی و برنامه اندروید
        </p>
        <p class="tx tx-lg">
            رویدینو، پلتفرم دانلود رایگان بازی و برنامه اندروید
        </p>
        <p class="tx tx-md">
            رویدینو، پلتفرم دانلود رایگان بازی و برنامه اندروید
        </p>
        <p class="tx tx-base">
            رویدینو، پلتفرم دانلود رایگان بازی و برنامه اندروید
        </p>
        <p class="tx tx-sm">
            رویدینو، پلتفرم دانلود رایگان بازی و برنامه اندروید
        </p>
        <p class="tx tx-xs">
            رویدینو، پلتفرم دانلود رایگان بازی و برنامه اندروید
        </p>
        
    </div>
</template>

